//相传韩信才智过人，从不直接清点自己军队的人数，只要让士兵先后以三人一排、五人一排、七人一排地变换队形，而他每次只掠一眼队伍的排尾就知道总人数了。
//输入包含多组数据，每组数据包含3个非负整数a，b，c，表示每种队形排尾的人数（a＜3，b＜5，c＜7），
//输出总人数的最小值（或报告无解 No Answer）。已知总人数不小于10，不超过100。输入到文件结束为止。
#include <stdio.h>
int main()
{
	int a,b,c,o,p,q,x;
	x = 0; 
	scanf("%d %d %d",&a,&b,&c);
	for(q = 1;q<15;q++){
		for(p = 2;p<21;p++){
			for(o = 3;o<34;o++ ){
				int d = 3*o+a;
				if(5*p+b==d && 7*q+c==d ){
					if(d>=10 && d<=100){
					    printf("%d",d);
					    x = 1;
				    }
				    break; 
				}
			} 
		}
	}
	if(x == 0){
		printf("No Answer");
	}
	return 0;
}
